---
title: "Data wrangling"
format: 
  html:
    code-fold: false
    toc-depth: 4
jupyter: python3
---

Data wrangling refers to combining, transforming, and re-arranging data to make it suitable for further analysis. We'll use Pandas for all data wrangling operations.

In [73]:
import pandas as pd
import numpy as np

## Hierarchical indexing

Until now we have seen only a single level of indexing in the rows and columns of a Pandas DataFrame. Hierarchical indexing refers to having multiple index levels on an axis (row / column) of a Pandas DataFrame. It helps us to work with a higher dimensional data in a lower dimensional form.

### Hierarchical indexing in Pandas Series

Let use define Pandas Series as we defined in Chapter 5:

In [43]:
#Defining a Pandas Series
series_example = pd.Series(['these','are','english','words','estas','son','palabras','en','español',
                            'ce','sont','des','françai','mots'])
series_example

0        these
1          are
2      english
3        words
4        estas
5          son
6     palabras
7           en
8      español
9           ce
10        sont
11         des
12     françai
13        mots
dtype: object

Let us use the attribute `nlevels` to find the number of levels of the row indices of this Series:

In [5]:
series_example.index.nlevels

1

The Series `series_example` has only one level of row indices.

Let us introduce another level of row indices while defining the Series:

In [45]:
#Defining a Pandas Series with multiple levels of row indices
series_example = pd.Series(['these','are','english','words','estas','son','palabras','en','español',
                           'ce','sont','des','françai','mots'], 
                          index=[['English']*4+['Spanish']*5+['French']*5,list(range(1,5))+list(range(1,6))*2])
series_example

English  1       these
         2         are
         3     english
         4       words
Spanish  1       estas
         2         son
         3    palabras
         4          en
         5     español
French   1          ce
         2        sont
         3         des
         4     françai
         5        mots
dtype: object

In the above Series, there are two levels of row indices:

In [46]:
series_example.index.nlevels

2

### Hierarchical indexing in Pandas DataFrame

In a Pandas DataFrame, both the row and the columns can have hierarchical indexing. For example, consider the DataFrame below:

In [134]:
data=np.array([[771517,2697000,815201,3849000],[4.2,5.6,2.8,4.6],
             [7.8,234.5,46.9,502],[6749, 597, 52, 305]])
df_example = pd.DataFrame(data,index = [['Demographics']*2+['Geography']*2,
                                      ['Population','Unemployement (%)','Area (mile-sq)','Elevation (feet)']],
                    columns = [['Illinois']*2+['California']*2,['Evanston','Chicago','San Francisco','Los Angeles']])
df_example

                                Illinois               California
                                Evanston    Chicago San Francisco Los Angeles
Demographics Population         771517.0  2697000.0      815201.0   3849000.0
             Unemployement (%)       4.2        5.6           2.8         4.6
Geography    Area (mile-sq)          7.8      234.5          46.9       502.0
             Elevation (feet)     6749.0      597.0          52.0       305.0

In the above DataFrame, both the rows and columns have 2 levels of indexing. The number of levels of column indices can be found using the attribute `nlevels`:

In [135]:
df_example.columns.nlevels

2

The `columns` attribute will now have a *MultiIndex* datatype in contrast to the *Index* datatype with single level of indexing. The same holds for row indices.

In [141]:
type(df_example.columns)

pandas.core.indexes.multi.MultiIndex

In [140]:
df_example.columns

MultiIndex([(  'Illinois',      'Evanston'),
            (  'Illinois',       'Chicago'),
            ('California', 'San Francisco'),
            ('California',   'Los Angeles')],
           )

The hierarchical levels can have names. Let us assign names to the each level of the row and column labels:

In [173]:
#Naming the row indices levels
df_example.index.names=['Information type', 'Statistic']

#Naming the column indices levels
df_example.columns.names=['State', 'City']

#Viewing the DataFrame
df_example

State                               Illinois               California  \
City                                Evanston    Chicago San Francisco
Information type Statistic
Demographics     Population         771517.0  2697000.0      815201.0
                 Unemployement (%)       4.2        5.6           2.8
Geography        Area (mile-sq)          7.8      234.5          46.9
                 Elevation (feet)     6749.0      597.0          52.0

State
City                               Los Angeles
Information type Statistic
Demographics     Population          3849000.0
                 Unemployement (%)         4.6
Geography        Area (mile-sq)          502.0
                 Elevation (feet)        305.0

Observe that the names of the row and column labels appear when we view the DataFrame.

#### [`get_level_values()`](https://pandas.pydata.org/docs/reference/api/pandas.Index.get_level_values.html)

The names of the column levels can be obained using the function `get_level_values()`. The outer-most level corresponds to the *level = 0*, and it increses as we go to the inner levels.

In [217]:
#Column levels at level 0 (the outer level)
df_example.columns.get_level_values(0)

Index(['Illinois', 'Illinois', 'California', 'California'], dtype='object', name='State')

In [218]:
#Column levels at level 1 (the inner level)
df_example.columns.get_level_values(1)

Index(['Evanston', 'Chicago', 'San Francisco', 'Los Angeles'], dtype='object', name='City')

### Subsetting data

We can use the indices at the outer levels to concisely subset a Series / DataFrame.

The first four observations of the Series `series_example` correspond to the outer row index `English`, while the last 5 rows correspond to the outer row index `Spanish`. Let us subset all the observation corresponding to the outer row index `English`:

In [47]:
#Subsetting data by row-index
series_example['English']

1      these
2        are
3    english
4      words
dtype: object

Just like in the case of single level indices, if we wish to subset corresponding to multiple outer-level indices, we put the indices within an additional box bracket `[]`. For example, let us subset all the observations corresponding to the row-indices `English` and `French`:

In [48]:
#Subsetting data by multiple row-indices
series_example[['English','French']]

English  1      these
         2        are
         3    english
         4      words
French   1         ce
         2       sont
         3        des
         4    françai
         5       mots
dtype: object

We can also subset data using the inner row index. However, we will need to put a `:` sign to indicate that the row label at the inner level is being used.

In [161]:
#Subsetting data by row-index
series_example[:,2]

English     are
Spanish     son
French     sont
dtype: object

In [50]:
#Subsetting data by mutiple row-indices
series_example.loc[:,[1,2]]

English  1    these
Spanish  1    estas
French   1       ce
English  2      are
Spanish  2      son
French   2     sont
dtype: object

As in Series, we can concisely subset rows / columns in a DataFrame based on the index at the outer levels.

In [170]:
df_example['Illinois']

                                Evanston    Chicago
Demographics Population         771517.0  2697000.0
             Unemployement (%)       4.2        5.6
Geography    Area (mile-sq)          7.8      234.5
             Elevation (feet)     6749.0      597.0

Note that the dataype of each column name is a tuple. For example, let us find the datatype of the $1^{st}$ column name:

In [223]:
#First column name
df_example.columns[0]

('Illinois', 'Evanston')

In [220]:
#Datatype of first column name
type(df_example.columns[0])

tuple

Thus columns at the inner levels can be accessed by specifying the name as a tuple. For example, let us subset the column `Evanston`:

In [225]:
#Subsetting the column 'Evanston'
df_example[('Illinois','Evanston')]

Information type  Statistic
Demographics      Population           771517.0
                  Unemployement (%)         4.2
Geography         Area (mile-sq)            7.8
                  Elevation (feet)       6749.0
Name: (Illinois, Evanston), dtype: float64

In [254]:
#Subsetting the columns 'Evanston' and 'Chicago' of the outer column level 'Illinois'
df_example.loc[:,('Illinois',['Evanston','Chicago'])]

State                               Illinois
City                                Evanston    Chicago
Information type Statistic
Demographics     Population         771517.0  2697000.0
                 Unemployement (%)       4.2        5.6
Geography        Area (mile-sq)          7.8      234.5
                 Elevation (feet)     6749.0      597.0

### Practice exercise 1

Read the table consisting of GDP per capita of countries from the webpage: https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita . 

To only read the relevant table, read the tables that contain the word *'Country'*. How many levels of indexing are there in the rows and columns?

In [261]:
dfs = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita', match = 'Country')
gdp_per_capita = dfs[0]
gdp_per_capita

              Country/Territory UN Region   IMF[4]       World Bank[5]        \
              Country/Territory UN Region Estimate  Year      Estimate  Year
0               Liechtenstein *    Europe        —     —        169049  2019
1                      Monaco *    Europe        —     —        173688  2020
2                  Luxembourg *    Europe   127673  2022        135683  2021
3                     Bermuda *  Americas        —     —        110870  2021
4                     Ireland *    Europe   102217  2022         99152  2021
..                          ...       ...      ...   ...           ...   ...
217                Madagascar *    Africa      522  2022           515  2021
218  Central African Republic *    Africa      496  2022           512  2021
219              Sierra Leone *    Africa      494  2022           516  2021
220               South Sudan *    Africa      328  2022          1120  2015
221                   Burundi *    Africa      293  2022           237  2021

    United Nations[6]
             Estimate  Year
0              180227  2020
1              173696  2020
2              117182  2020
3              123945  2020
4               86251  2020
..                ...   ...
217               470  2020
218               481  2020
219               475  2020
220              1421  2020
221               286  2020

[222 rows x 8 columns]

#### 
Subset a DataFrame that select the country, and the United Nations estimates of GDP per capita with the corresponding year.

In [270]:
gdp_per_capita.loc[:,['Country/Territory','United Nations[6]']]

              Country/Territory United Nations[6]
              Country/Territory          Estimate  Year
0               Liechtenstein *            180227  2020
1                      Monaco *            173696  2020
2                  Luxembourg *            117182  2020
3                     Bermuda *            123945  2020
4                     Ireland *             86251  2020
..                          ...               ...   ...
217                Madagascar *               470  2020
218  Central African Republic *               481  2020
219              Sierra Leone *               475  2020
220               South Sudan *              1421  2020
221                   Burundi *               286  2020

[222 rows x 3 columns]

#### 
Subset a DataFrame that select only the World Bank and United Nations estimates of GDP per capita without the corresponding year or country.

In [280]:
gdp_per_capita.loc[:,(['World Bank[5]','United Nations[6]'],'Estimate')]

    World Bank[5] United Nations[6]
         Estimate          Estimate
0          169049            180227
1          173688            173696
2          135683            117182
3          110870            123945
4           99152             86251
..            ...               ...
217           515               470
218           512               481
219           516               475
220          1120              1421
221           237               286

[222 rows x 2 columns]

#### 
Subset a DataFrame that select the country and only the World Bank and United Nations estimates of GDP per capita without the corresponding year or country.

In [292]:
gdp_per_capita.loc[:,[('Country/Territory','Country/Territory'),('United Nations[6]','Estimate'),('World Bank[5]','Estimate')]]

              Country/Territory United Nations[6] World Bank[5]
              Country/Territory          Estimate      Estimate
0               Liechtenstein *            180227        169049
1                      Monaco *            173696        173688
2                  Luxembourg *            117182        135683
3                     Bermuda *            123945        110870
4                     Ireland *             86251         99152
..                          ...               ...           ...
217                Madagascar *               470           515
218  Central African Republic *               481           512
219              Sierra Leone *               475           516
220               South Sudan *              1421          1120
221                   Burundi *               286           237

[222 rows x 3 columns]

Drop all columns consisting of years. Use the `level` argument of the `drop()` method.

In [297]:
gdp_per_capita.drop(columns='Year',level=1)

,Country/Territory,UN Region,IMF[4],World Bank[5],United Nations[6]
,Country/Territory,UN Region,Estimate,Estimate,Estimate
0,Liechtenstein *,Europe,—,169049,180227
1,Monaco *,Europe,—,173688,173696
2,Luxembourg *,Europe,127673,135683,117182
3,Bermuda *,Americas,—,110870,123945
4,Ireland *,Europe,102217,99152,86251
...,...,...,...,...,...
217,Madagascar *,Africa,522,515,470
218,Central African Republic *,Africa,496,512,481
219,Sierra Leone *,Africa,494,516,475
220,South Sudan *,Africa,328,1120,1421
221,Burundi *,Africa,293,237,286

Drop the outer level of the column labels. Use the [`droplevel()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.droplevel.html) method.

In [304]:
gdp_per_capita2 = gdp_per_capita.columns.droplevel(1)
gdp_per_capita2

Index(['Country/Territory', 'UN Region', 'IMF[4]', 'IMF[4]', 'World Bank[5]',
       'World Bank[5]', 'United Nations[6]', 'United Nations[6]'],
      dtype='object')

In [310]:
gdp_per_capita.droplevel(1,axis=1)

,Country/Territory,UN Region,IMF[4],IMF[4],World Bank[5],World Bank[5],United Nations[6],United Nations[6]
0,Liechtenstein *,Europe,—,—,169049,2019,180227,2020
1,Monaco *,Europe,—,—,173688,2020,173696,2020
2,Luxembourg *,Europe,127673,2022,135683,2021,117182,2020
3,Bermuda *,Americas,—,—,110870,2021,123945,2020
4,Ireland *,Europe,102217,2022,99152,2021,86251,2020
...,...,...,...,...,...,...,...,...
217,Madagascar *,Africa,522,2022,515,2021,470,2020
218,Central African Republic *,Africa,496,2022,512,2021,481,2020
219,Sierra Leone *,Africa,494,2022,516,2021,475,2020
220,South Sudan *,Africa,328,2022,1120,2015,1421,2020
221,Burundi *,Africa,293,2022,237,2021,286,2020

### Practice exercise 2

Let us try to find the areas where NU students lack in diversity. Read *survey_data_clean.csv*. Use hierarchical indexing to classify the columns as follows:

Classify the following variables as *lifestyle*:

In [213]:
lifestyle = ['fav_alcohol', 'parties_per_month', 'smoke', 'weed','streaming_platforms', 'minutes_ex_per_week',
       'sleep_hours_per_day', 'internet_hours_per_day', 'procrastinator', 'num_clubs','student_athlete','social_media']

Classify the following variables as *personality*:

In [ ]:
personality = ['introvert_extrovert', 'left_right_brained', 'personality_type', 
       'num_insta_followers', 'fav_sport','learning_style','dominant_hand']

Classify the following variables as *opinion*:

In [ ]:
opinion = ['love_first_sight', 'expected_marriage_age',  'expected_starting_salary', 'how_happy', 
       'fav_number', 'fav_letter', 'fav_season',   'political_affliation', 'cant_change_math_ability',
       'can_change_math_ability', 'math_is_genetic', 'much_effort_is_lack_of_talent']

Classify the following variables as *academic information*:

In [ ]:
academic_info = ['major', 'num_majors_minors',
       'high_school_GPA', 'NU_GPA', 'school_year','AP_stats', 'used_python_before']

Classify the following variables as *demographics*:

In [214]:
demographics = [ 'only_child','birth_month', 
       'living_location_on_campus', 'age', 'height', 'height_father',
       'height_mother',  'childhood_in_US', 'gender', 'region_of_residence']

Write a function that finds the number of variables having outliers in a dataset. Apply the function on each of the 5 categories of variables in the dataset. Our hypothesis is that the category that has the maximum number of variables with outliers has the least amount of diversity.

### Reshaping data

Apart from ease in subsetting data, hierarchical indexing also plays a role in reshaping data.

#### [`unstack()`](https://pandas.pydata.org/docs/reference/api/pandas.Series.unstack.html) (Pandas Series method)
The Pandas Series method `unstack()` pivots the desired level of row indices to columns, thereby creating a DataFrame. By default, the inner-most level of the row labels is pivoed.

In [52]:
#Pivoting the inner-most Series row index to column labels
series_example_unstack = series_example.unstack()
series_example_unstack

             1     2         3        4        5
English  these   are   english    words      NaN
French      ce  sont       des  françai     mots
Spanish  estas   son  palabras       en  español

We can pivot the outer level of the row labels by specifying it in the `level` argument:

In [192]:
#Pivoting the outer row indices to column labels
series_example_unstack = series_example.unstack(level=0)
series_example_unstack

   English   French   Spanish
1    these       ce     estas
2      are     sont       son
3  english      des  palabras
4    words  françai        en
5      NaN     mots   español

#### [`unstack()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.unstack.html) (Pandas DataFrame method)
The Pandas DataFrame method `unstack()` pivots the specifid level of row indices to the new innemost level of column labels. By-default, the inner-most level of the row labels is pivoted.

In [181]:
#Pivoting the inner level of row labels to the inner-most level of column labels
df_example.unstack()

State                  Illinois                                                \
City                   Evanston
Statistic        Area (mile-sq) Elevation (feet) Population Unemployement (%)
Information type
Demographics                NaN              NaN   771517.0               4.2
Geography                   7.8           6749.0        NaN               NaN

State                                                                          \
City                    Chicago
Statistic        Area (mile-sq) Elevation (feet) Population Unemployement (%)
Information type
Demographics                NaN              NaN  2697000.0               5.6
Geography                 234.5            597.0        NaN               NaN

State                California                                                \
City              San Francisco
Statistic        Area (mile-sq) Elevation (feet) Population Unemployement (%)
Information type
Demographics                NaN              NaN   815201.0               2.8
Geography                  46.9             52.0        NaN               NaN

State
City                Los Angeles
Statistic        Area (mile-sq) Elevation (feet) Population Unemployement (%)
Information type
Demographics                NaN              NaN  3849000.0               4.6
Geography                 502.0            305.0        NaN               NaN

As with Series, we can pivot the outer level of the row labels by specifying it in the `level` argument:

In [188]:
#Pivoting the outer level (level = 0) of row labels to the inner-most level of column labels
df_example.unstack(level=0)

State                 Illinois                                     California  \
City                  Evanston                Chicago           San Francisco
Information type  Demographics Geography Demographics Geography  Demographics
Statistic
Area (mile-sq)             NaN       7.8          NaN     234.5           NaN
Elevation (feet)           NaN    6749.0          NaN     597.0           NaN
Population            771517.0       NaN    2697000.0       NaN      815201.0
Unemployement (%)          4.2       NaN          5.6       NaN           2.8

State
City                         Los Angeles
Information type  Geography Demographics Geography
Statistic
Area (mile-sq)         46.9          NaN     502.0
Elevation (feet)       52.0          NaN     305.0
Population              NaN    3849000.0       NaN
Unemployement (%)       NaN          4.6       NaN

#### `stack()`

The inverse of `unstack()` is the [`stack()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html) method, which creates the inner-most level of row indices by pivoting the column labels of the prescribed level.

Note that if the column labels have only one level, so we don't need to specify a level.

In [66]:
#Stacking the columns of a DataFrame
series_example_unstack.stack()

English  1       these
         2         are
         3     english
         4       words
French   1          ce
         2        sont
         3         des
         4     françai
         5        mots
Spanish  1       estas
         2         son
         3    palabras
         4          en
         5     español
dtype: object

However, if the columns have multiple levels, we can specify the level to stack as the inner-most row level. By default, inner-most column level is stacked.

In [195]:
#Stacking the inner-most column labels inner-most row indices
df_example.stack()

State                                             California   Illinois
Information type Statistic         City
Demographics     Population        Chicago               NaN  2697000.0
                                   Evanston              NaN   771517.0
                                   Los Angeles     3849000.0        NaN
                                   San Francisco    815201.0        NaN
                 Unemployement (%) Chicago               NaN        5.6
                                   Evanston              NaN        4.2
                                   Los Angeles           4.6        NaN
                                   San Francisco         2.8        NaN
Geography        Area (mile-sq)    Chicago               NaN      234.5
                                   Evanston              NaN        7.8
                                   Los Angeles         502.0        NaN
                                   San Francisco        46.9        NaN
                 Elevation (feet)  Chicago               NaN      597.0
                                   Evanston              NaN     6749.0
                                   Los Angeles         305.0        NaN
                                   San Francisco        52.0        NaN

In [196]:
#Stacking the outer column labels inner-most row indices
df_example.stack(level=0)

City                                             Chicago  Evanston  \
Information type Statistic         State
Demographics     Population        California        NaN       NaN
                                   Illinois    2697000.0  771517.0
                 Unemployement (%) California        NaN       NaN
                                   Illinois          5.6       4.2
Geography        Area (mile-sq)    California        NaN       NaN
                                   Illinois        234.5       7.8
                 Elevation (feet)  California        NaN       NaN
                                   Illinois        597.0    6749.0

City                                           Los Angeles  San Francisco
Information type Statistic         State
Demographics     Population        California    3849000.0       815201.0
                                   Illinois            NaN            NaN
                 Unemployement (%) California          4.6            2.8
                                   Illinois            NaN            NaN
Geography        Area (mile-sq)    California        502.0           46.9
                                   Illinois            NaN            NaN
                 Elevation (feet)  California        305.0           52.0
                                   Illinois            NaN            NaN